Repository: Kingkull2811/chat_app
Catalog: lib/l10n/arb/app_*.arb
Languages: vi

source: OK
vi: Chấp nhận

source: Cancel
vi: Hủy

source: Error!
vi: Lỗi!

source: Save
vi: Lưu

source: Successfully!
vi: Thành công!

source: Internal Server Error
vi: Lỗi Máy chủ Nội bộ

# photo_camera
source: Take a photo from camera
vi: Chụp ảnh từ máy ảnh

# photo_gallery
source: Choose a photo from gallery
vi: Chọn ảnh từ thư viện

source: Select Student
vi: Chọn sinh viên

source: Student Id:
vi: Mã sinh viên:

source: Student Name:
vi: Tên sinh viên:

# dob
source: Date of birth:
vi: Ngày sinh:

# classTitle
source: Class:
vi: Lớp:

# view_list_added
source: View the list of students added
vi: Xem danh sách sinh viên đã thêm

# no_find_student
source: Can\'t find student with student SSID:
vi: Không thể tìm thấy sinh viên có SSID sinh viên:

# search_ssid
source: Search with SSID
vi: Tìm kiếm bằng SSID

# search_w_ssid
source: Search student with student SSID
vi: Tìm kiếm sinh viên với SSID sinh viên

# no_internet_title
source: No Internet Connection
vi: Không có kết nối Internet

# no_internet_content
source: Please check your internet connection again or connect to Wi-fi
vi: Vui lòng kiểm tra lại kết nối internet của bạn hoặc kết nối với Wi-fi

# parent
source: Student\'s Parent
vi: Phụ huynh của học sinh

source: Username
vi: Tên người dùng

# enter_username
source: Please enter username
vi: Vui lòng nhập tên người dùng

source: Full name
vi: Tên đầy đủ

# enter_fullname
source: Please enter full name
vi: Vui lòng nhập tên đầy đủ

# enter_email
source: Please enter email
vi: Vui lòng nhập email

# valid_email
source: Please enter valid email
vi: Vui lòng nhập email hợp lệ

# phone
source: Phone number
vi: Số điện thoại

# enter_phone
source: Please enter phone number
vi: Vui lòng nhập số điện thoại

# empty_avatar
source: Image avatar cannot be empty
vi: Hình đại diện không được để trống

# resetPassword
source: Reset your password
vi: Đặt lại mật khẩu của bạn

# enterEmailToReset
source: Please enter your email. We will send a code to your email to reset your password.
vi: Vui lòng nhập email của bạn. Chúng tôi sẽ gửi mã đến email của bạn để đặt lại mật khẩu.

# sendCode
source: Send me Code
vi: Gửi mã cho tôi

source: Forgot Password
vi: Quên mật khẩu

source: Password
vi: Mật khẩu

# enterPassword
source: Please enter password
vi: Vui lòng nhập mật khẩu

# passwordLeast
source: Password must be at least 6 characters
vi: Mật khẩu phải có ít nhất 6 ký tự

# passwordLess
source: Password must be less than 40 characters
vi: Mật khẩu phải nhỏ hơn 40 ký tự

# noUserInfor
source: Can\'t get user info
vi: Không thể lấy thông tin người dùng

# wrong
source: Something is wrong, please try again later!
vi: Đã xảy ra lỗi, vui lòng thử lại sau!

# wrongU
source: Wrong username or password
vi: Sai tên người dùng hoặc mật khẩu

source: Login
vi: Đăng nhập

source: Sign Up
vi: Đăng ký

# noAccount
source: Don\'t have an account?
vi: Bạn chưa có tài khoản?

# remember
source: Remember password
vi: Ghi nhớ mật khẩu

# setNewPassword
source: Set a new password
vi: Đặt mật khẩu mới

source: New password
vi: Mật khẩu mới

# enterNewPassword
source: Please enter your new password
vi: Xin vui lòng nhập mật khẩu mới của bạn

# confirmNewPass
source: Confirm new password
vi: Xác nhận mật khẩu mới

# enterConfirmPass
source: Please enter confirm new password
vi: Vui lòng nhập xác nhận mật khẩu mới

# passwordNotMatch
source: New password and confirm new password do not match
vi: Mật khẩu mới và xác nhận mật khẩu mới không khớp

# setPassword
source: Set a password
vi: Đặt mật khẩu

# confirmPass
source: Confirm password
vi: Xác nhận mật khẩu

source: Security
vi: Bảo mật

source: Change Password
vi: Đổi mật khẩu

source: Old Password
vi: Mật khẩu cũ

# enterOldPassword
source: Please enter old password
vi: Vui lòng nhập mật khẩu cũ

# enterConPass
source: Please enter confirm password
vi: Vui lòng nhập xác nhận mật khẩu

# passwordMatch
source: Password and confirm password do not match
vi: Mật khẩu và mật khẩu xác nhận không khớp

# isTeacher
source: You are teacher?
vi: Bạn là giáo viên?

# plsLogin
source: Please login!
vi: Xin vui lòng đăng nhập!

# alreadyAcc
source: Already have an account?
vi: Đã có tài khoản?

# otp
source: OTP Verification
vi: Xác minh OTP

# willSend
source: We will send you an onetime OTP code on the email:
vi: Chúng tôi sẽ gửi cho bạn mã OTP dùng một lần qua email:

source: Verify
vi: Xác minh

source: Verified!
vi: Đã xác minh!

# accVerified
source: You have verified your account.
vi: Bạn đã xác minh tài khoản của mình.

# resendOtp
source: Didn\'t you receive the OTP code?
vi: Bạn không nhận được mã OTP à?

# resend
source: Resend Code
vi: Gửi lại mã

# incomeCall
source: Incoming call
vi: Cuộc gọi đến

# inProcessCall
source: Call in progress
vi: Cuộc gọi đang diễn ra

# remindMe
source: Reminder me
vi: Nhắc tôi

source: Message
vi: Nhắn tin

# slideTalk
source: Slide to Talk
vi: Trượt để nói chuyện

source: Audio
vi: Âm thanh

source: Profile
vi: Hồ sơ

source: Block
vi: Chặn

# blockContent
source: Do you want block
vi: Bạn có muốn chặn không

# blockContent2
source: \nAfter block, you can send message to
vi: \nSau khi chặn, bạn có thể gửi tin nhắn tới

# blockContent3
source: and vice versa.
vi: và ngược lại.

source: Delete
vi: Xóa

source: Delete chat
vi: Xóa trò chuyện

# deleteContent
source: Do you want to delete this chat? Once deleted, you cannot restore this chat.
vi: Bạn có muốn xóa cuộc trò chuyện này không? Sau khi xóa, bạn không thể khôi phục cuộc trò chuyện này.

# deleteContent2
source: \nAt the same time, this conversation will also be deleted for the remaining person in this chat.
vi: \nĐồng thời, cuộc trò chuyện này cũng sẽ bị xóa đối với người còn lại trong cuộc trò chuyện này.

# sayHi
source: Say hi 👋 to start chat with
vi: Nói xin chào 👋 để bắt đầu trò chuyện với

# noRecent
source: No Recents
vi: Không có tin tức gần đây

source: No contact
vi: Không có liên lạc

# createMessage
source: Create new message
vi: Tạo tin nhắn mới

source: Name:
vi: Tên:

# tel
source: Phone:
vi: Điện thoại:

source: Parent of:
vi: Cha mẹ của:

source: Search
vi: Tìm kiếm

source: Chats
vi: Trò chuyện

source: Contacts
vi: Danh bạ

source: News
vi: Tin tức

source: Transcript
vi: Bảng điểm

source: Manage
vi: Quản lý

source: Settings
vi: Cài đặt

# pressExit
source: Press back again to exit.
vi: Nhấn lại lần nữa để thoát.

source: Add News
vi: Thêm tin tức

source: Edit News
vi: Chỉnh sửa tin tức

source: Post News
vi: Đăng tin tức

# backNews
source: Go to news page
vi: Đi tới trang tin tức

# writeTitle
source: Write the title ...
vi: Viết tiêu đề ...

# writeContent
source: Write the content ...
vi: Viết nội dung...

# addImage
source: Add an image or video
vi: Thêm hình ảnh hoặc video

source: Update
vi: Cập nhật

source: Reload
vi: Tải lại

# noNews
source: No news available
vi: Không có tin tức nào

# more
source: show more
vi: xem thêm

# less
source: \nshow less
vi: \nẩn bớt

# deleteNews
source: Do you want to delete this news?
vi: Bạn có muốn xóa tin tức này không?

# notFindNews
source: Did not find the news
vi: Không tìm thấy tin tức

# deletedNews
source: The news has been deleted
vi: Tin tức đã bị xóa

# onboardingTitle1
source: Learning Results Tracking
vi: Theo dõi kết quả học tập

# onboardingContent1
source: Our app allows teachers to easily record and track student\'s learning outcomes.
vi: Ứng dụng của chúng tôi cho phép giáo viên dễ dàng ghi lại và theo dõi kết quả học tập của học sinh.

# onboardingContent11
source: Teachers can assess individual progress, identify areas of improvement, and tailor their teaching strategies accordingly. With comprehensive analytics and visualizations, educators can gain valuable insights into student performance.
vi: Giáo viên có thể đánh giá tiến bộ của từng cá nhân, xác định các lĩnh vực cần cải thiện và điều chỉnh chiến lược giảng dạy của họ cho phù hợp. Với các phân tích và hình ảnh trực quan toàn diện, nhà giáo dục có thể thu được những hiểu biết sâu sắc có giá trị về hiệu suất của học sinh.

# onboardingTitle2
source: Information Exchange
vi: Trao đổi thông tin

# onboardingContent2
source: We understand the importance of effective communication between teachers and parents. Our app facilitates seamless information exchange, enabling teachers to share important updates, homework assignments, and upcoming assessments directly with parents.
vi: Chúng tôi hiểu tầm quan trọng của việc giao tiếp hiệu quả giữa giáo viên và phụ huynh. Ứng dụng của chúng tôi tạo điều kiện trao đổi thông tin liền mạch, cho phép giáo viên chia sẻ trực tiếp các thông tin cập nhật quan trọng, bài tập về nhà và bài đánh giá sắp tới với phụ huynh.

# onboardingContent22
source: Parents can stay informed about their child\'s academic progress and provide necessary support.
vi: Phụ huynh có thể cập nhật thông tin về tiến độ học tập của con mình và cung cấp hỗ trợ cần thiết.

# onboardingTitle3
source: Real-time Notifications
vi: Thông báo theo thời gian thực

# onboardingContent3
source: Stay up-to-date with real-time notifications. Receive instant alerts regarding important deadlines, upcoming events, and announcements from the school.
vi: Luôn cập nhật các thông báo theo thời gian thực. Nhận thông báo tức thì về thời hạn quan trọng, sự kiện sắp tới và thông báo từ nhà trường.

# onboardingContent33
source: Be notified when a teacher sends a message or when a new grade is added, ensuring that you never miss crucial information.
vi: Được thông báo khi giáo viên gửi tin nhắn hoặc khi lớp mới được thêm vào, đảm bảo rằng bạn không bao giờ bỏ lỡ thông tin quan trọng.

source: Next
vi: Tiếp tục

# notiSound
source: Notification & Sound
vi: Thông báo & Âm thanh

# notiOn
source: Turn on the notification
vi: Bật thông báo

# notiOnLock
source: Notifications on lock screen
vi: Thông báo trên màn hình khóa

# notiPreviewOn
source: Turn on the notification preview
vi: Bật xem trước thông báo

# vibrateCall
source: Vibrate when a call coming
vi: Rung khi có cuộc gọi đến

source: Sound
vi: Âm thanh

# incomeCallSound
source: Incoming message sound
vi: Âm thanh tin nhắn đến

# waitingCallSound
source: Incoming call waiting sound
vi: Âm thanh chờ cuộc gọi đến

# userNotFound
source: This user data could not be found
vi: Không thể tìm thấy dữ liệu người dùng này

# noStudent
source: There is no data on students who are children of this parent
vi: Không có dữ liệu về học sinh là con của phụ huynh này

source: D.O.B:
vi: N/S:

# schoolY
source: School Year
vi: Năm học

# terms
source: Terms & Policies
vi: Điều khoản & Chính sách

source: Logout
vi: Đăng xuất

# wantLogout
source: Do you want to log out ?
vi: Bạn có muốn đăng xuất không?

# agreeTerms
source: Agree. I have read and understood
vi: Đồng ý. Tôi đã đọc và hiểu

source: Edit class
vi: Chỉnh sửa lớp

# addClass
source: Add new class
vi: Thêm lớp mới

source: Class Code
vi: Mã lớp

source: Class Name
vi: Tên lớp

# enterClass
source: Please enter class name
vi: Vui lòng nhập tên lớp

source: Select Year
vi: Chọn Năm

# plsYear
source: Please select school year
vi: Vui lòng chọn năm học

# enterClassCode
source: Please enter class code
vi: Vui lòng nhập mã lớp

# enterSubject
source: Please select the subject for class
vi: Vui lòng chọn chủ đề cho lớp học

# noClass
source: Class not found
vi: Không tìm thấy lớp

# failClass
source: Update class failure
vi: Cập nhật lỗi lớp

# addFailClass
source: Add new class failure
vi: Thêm lỗi lớp mới

# selectSubject
source: Select the subject for class
vi: Chọn môn học cho lớp

# noSubject
source: Subject data not found
vi: Không tìm thấy dữ liệu chủ đề

# selectSY
source: Select School Year
vi: Chọn năm học

# noSemester
source: List semester not found
vi: Không tìm thấy danh sách học kỳ

source: List Class:
vi: Lớp danh sách:

# deleteClass
source: Do you want to delete this class?
vi: Bạn có muốn xóa lớp này không?

source: Year:
vi: Năm:

source: Serial
vi: Nối tiếp

# subCode
source: Subject code
vi: Mã chủ đề

# subName
source: Subject name
vi: Tên chủ đề

# addStu
source: Add a new student
vi: Thêm một học sinh mới

# editStu
source: Edit student info
vi: Chỉnh sửa thông tin sinh viên

# enterSSID
source: Please enter SSID like SSID**** with * is the number
vi: Hãy nhập SSID như SSID**** với * là số

# noEmptySSID
source: SSID can\'t be empty
vi: SSID không được để trống

# stuSSID
source: Student SSID
vi: SSID của sinh viên

# stuName
source: Student name
vi: Tên sinh viên

# enterStuName
source: Please enter the student\'s name
vi: Vui lòng nhập tên học sinh

# enterDOB
source: Please enter date of birth
vi: Vui lòng nhập ngày sinh

# selectClass
source: Please select class
vi: Hãy chọn lớp

# selectScY
source: Please select school year
vi: Hãy chọn năm học

# stuImage
source: Student Image
vi: Hình ảnh học sinh

# searchStu
source: Select student ...
vi: Chọn sinh viên ...

# deleteStu
source: Do you want delete this student's information?
vi: Bạn có muốn xóa thông tin của học sinh này không?

# noStu
source: Student's information not found
vi: Không tìm thấy thông tin sinh viên

# addStuImage
source: Add a student image
vi: Thêm hình ảnh học sinh

# addImageStu
source: Please add student image
vi: Vui lòng thêm hình ảnh học sinh

# addStuFail
source: Add new student's information failure
vi: Lỗi thêm thông tin học sinh mới

# updateStuSuccess
source: Update student's information success
vi: Cập nhật thông tin sinh viên thành công

# updateStuFail
source: Update student's information failure
vi: Cập nhật thông tin sinh viên không thành công

# stuManage
source: Students Management
vi: Quản lý sinh viên

# students
source: List student:
vi: Danh sách sinh viên:

# selClass
source: Select Class
vi: Chọn Lớp

# subjects
source: List Subject:
vi: Danh sách chủ đề:

# deleteSub
source: Do you want to delete this subject?
vi: Bạn có muốn xóa chủ đề này không?

# addSub
source: Add new subject
vi: Thêm chủ đề mới

# editSub
source: Edit subject
vi: Chỉnh sửa chủ đề

# emptySubCode
source: Subject Code can\'t be empty
vi: Mã chủ đề không được để trống

# emptySubName
source: Subject Name can\'t be empty
vi: Tên chủ đề không được để trống

# addSubFail
source: Add new subject failure!
vi: Lỗi thêm chủ đề mới!

# updateSubSuccess
source: Update subject successfully!
vi: Cập nhật chủ đề thành công!

# updateSubFail
source: Update subject failure!
vi: Cập nhật chủ đề bị lỗi!

source: Semester
vi: Học kỳ

source: Enter point
vi: Nhập điểm

# point4Stu
source: Enter point subject for student:
vi: Nhập điểm môn học cho sinh viên:

source: Select Semester
vi: Chọn học kỳ

source: Update transcript done
vi: Cập nhật bản chép lời xong

# noChange
source: No change in the transcript yet.
vi: Chưa có thay đổi nào trong bản ghi.

# plsSelectSemester
source: Please select semester to show list subject point.
vi: Vui lòng chọn học kỳ để hiển thị danh sách điểm chủ đề.

# changeOral
source: Change Oral Test Point
vi: Thay đổi điểm thi vấn đáp

# change15
source: Change 15 Minutes Test Point
vi: Thay đổi điểm kiểm tra 15 phút

# change45
source: Change 45 Minutes Test Point
vi: Thay đổi điểm kiểm tra 45 phút

# changeFinal
source: Change Final Exam Test Point
vi: Thay đổi điểm thi cuối kỳ

source: Save change?
vi: Lưu thay đổi?

# saveChangeContent
source: The transcript has been changed, do you want to save this changes?
vi: Bản ghi đã bị thay đổi, bạn có muốn lưu thay đổi này không?

# oneGPA
source: Semester 1 GPA:
vi: Điểm trung bình học kỳ 1:

# twoGPA
source: Semester 2 GPA:
vi: Điểm trung bình học kỳ 2:

# yGPA
source: School year GPA:
vi: Điểm trung bình năm học:

source: Subject Name
vi: Tên chủ đề

# tOral
source: Oral test
vi: Kiểm tra miệng

# t15
source: 15m Test
vi: Thử nghiệm 15m

# t45
source: 45m Test
vi: Thử nghiệm 45m

# tFinal
source: Final Test
vi: Bài kiểm tra cuối cùng

# sGPA
source: Semester GPA
vi: Điểm trung bình học kỳ
